# BuiltInFailures.PartMakerMethodForWallFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForWallFailures Class
BuiltInFailures Class Members See Also
---
Failures related to parts related to walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PartMakerMethodForWallFailures
```

Visual Basic
---
```text
Public NotInheritable Class PartMakerMethodForWallFailures
```

Visual C++
---
```text
public ref class PartMakerMethodForWallFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PartMakerMethodForWallFailures
# See Also
BuiltInFailures..::..PartMakerMethodForWallFailures Members
Autodesk.Revit.DB Namespace